In [22]:
import sqlite3
import pandas as pd

# Conectarse a la base de datos
conn = sqlite3.connect("database/ventas.db")

In [23]:
query = """
DROP TABLE IF EXISTS ventas;
DROP TABLE IF EXISTS productos;
DROP TABLE IF EXISTS clientes;

CREATE TABLE clientes (
    cliente_id INTEGER PRIMARY KEY,
    nombre TEXT,
    edad INTEGER,
    ciudad TEXT,
    fecha_registro DATE
);

CREATE TABLE productos (
    producto_id INTEGER PRIMARY KEY,
    nombre_producto TEXT,
    categoria TEXT,
    precio INTEGER
);

CREATE TABLE ventas (
    venta_id INTEGER PRIMARY KEY,
    cliente_id INTEGER,
    producto_id INTEGER,
    fecha_venta DATE,
    cantidad INTEGER,
    total INTEGER
);
"""

conn.executescript(query)

In [24]:
clientes = [
    (1, 'Ana Gómez', 28, 'Bogotá', '2023-01-15'),
    (2, 'Carlos Pérez', 35, 'Medellín', '2023-02-10'),
    (3, 'Laura Torres', 22, 'Cali', '2023-03-05'),
    (4, 'Miguel Ruiz', 41, 'Bogotá', '2023-01-20'),
    (5, 'Sofía Martínez', 30, 'Barranquilla', '2023-02-01'),
    (6, 'Andrés López', 27, 'Bello', '2023-02-25'),
    (7, 'David Zapata', 33, 'Medellín', '2023-02-08'),
    (8, 'Luis Ramirez', 18, 'Barranquilla', '2023-01-14'),
    (9, 'Camilo Celis', 50, 'Cartagena', '2022-07-27'),
    (10, 'Lina Vélez', 45, 'Santa Marta', '2023-02-30'),
    (11, 'Liss Franco', 25, 'Medellín', '2023-01-04'),
    (12, 'Kate Marin', 24, 'Cartagena', '2022-10-27'),
    (13, 'Angel Sanchez', 37, 'Medellín', '2022-08-12'),
    (14, 'Fabián Rodriguez', 29, 'Cali', '2023-02-25'),
    (15, 'Javier Torres', 30, 'Bogotá', '2023-01-03')
]

conn.executemany(
    "INSERT INTO clientes VALUES (?, ?, ?, ?, ?)",
    clientes
)
conn.commit()

In [25]:
pd.read_sql("SELECT * FROM clientes", conn)

    cliente_id            nombre  edad        ciudad fecha_registro
0            1         Ana Gómez    28        Bogotá     2023-01-15
1            2      Carlos Pérez    35      Medellín     2023-02-10
2            3      Laura Torres    22          Cali     2023-03-05
3            4       Miguel Ruiz    41        Bogotá     2023-01-20
4            5    Sofía Martínez    30  Barranquilla     2023-02-01
5            6      Andrés López    27         Bello     2023-02-25
6            7      David Zapata    33      Medellín     2023-02-08
7            8      Luis Ramirez    18  Barranquilla     2023-01-14
8            9      Camilo Celis    50     Cartagena     2022-07-27
9           10        Lina Vélez    45   Santa Marta     2023-02-30
10          11       Liss Franco    25      Medellín     2023-01-04
11          12        Kate Marin    24     Cartagena     2022-10-27
12          13     Angel Sanchez    37      Medellín     2022-08-12
13          14  Fabián Rodriguez    29          Cali     2023-02-25
14          15     Javier Torres    30        Bogotá     2023-01-03

In [26]:
productos = [
    (101, 'Auriculares Bluetooth', 'Tecnología', 120000),
(102, 'Teclado Mecánico', 'Tecnología', 250000),
(103, 'Mouse Inalámbrico', 'Tecnología', 80000),
(104, 'Monitor 24"', 'Tecnología', 650000),
(105, 'Camiseta Básica', 'Ropa', 45000),
(106, 'Jeans', 'Ropa', 120000),
(107, 'Zapatos Deportivos', 'Ropa', 180000),
(108, 'Chaqueta', 'Ropa', 220000),
(109, 'Mochila Urbana', 'Accesorios', 95000),
(110, 'Reloj Digital', 'Accesorios', 160000),
(111, 'Gorra', 'Accesorios', 35000),
(112, 'Audífonos Gamer', 'Tecnología', 300000)
]

conn.executemany(
    "INSERT INTO productos VALUES (?, ?, ?, ?)",
    productos
)
conn.commit()

In [27]:
pd.read_sql("SELECT * FROM productos", conn)

    producto_id        nombre_producto   categoria  precio
0           101  Auriculares Bluetooth  Tecnología  120000
1           102       Teclado Mecánico  Tecnología  250000
2           103      Mouse Inalámbrico  Tecnología   80000
3           104            Monitor 24"  Tecnología  650000
4           105        Camiseta Básica        Ropa   45000
5           106                  Jeans        Ropa  120000
6           107     Zapatos Deportivos        Ropa  180000
7           108               Chaqueta        Ropa  220000
8           109         Mochila Urbana  Accesorios   95000
9           110          Reloj Digital  Accesorios  160000
10          111                  Gorra  Accesorios   35000
11          112        Audífonos Gamer  Tecnología  300000

In [28]:
ventas = [
(1001, 1, 101, '2023-05-01', 1, 120000),
(1002, 2, 102, '2023-05-03', 1, 250000),
(1003, 3, 105, '2023-05-05', 2, 90000),
(1004, 1, 109, '2023-05-10', 1, 95000),
(1005, 4, 107, '2023-05-15', 1, 180000),
(1006, 5, 101, '2023-05-20', 1, 120000),
(1007, 6, 105, '2023-05-22', 3, 135000),
(1008, 2, 109, '2023-05-25', 1, 95000),
(1009, 7, 110, '2023-06-01', 1, 160000),
(1010, 8, 111, '2023-06-05', 2, 70000),
(1011, 9, 104, '2023-06-10', 1, 650000),
(1012, 10, 108, '2023-06-15', 1, 220000),
(1013, 11, 103, '2023-06-18', 1, 80000),
(1014, 12, 112, '2023-06-20', 1, 300000),
(1015, 13, 102, '2023-07-01', 1, 250000),
(1016, 14, 106, '2023-07-05', 2, 240000),
(1017, 15, 107, '2023-07-10', 1, 180000),
(1018, 3, 110, '2023-07-15', 1, 160000),
(1019, 6, 111, '2023-07-18', 3, 105000),
(1020, 2, 104, '2023-07-20', 1, 650000)
]

conn.executemany(
    "INSERT INTO ventas VALUES (?, ?, ?, ?, ?, ?)",
    ventas
)
conn.commit()

In [29]:
pd.read_sql("SELECT * FROM ventas", conn)

    venta_id  cliente_id  producto_id fecha_venta  cantidad   total
0       1001           1          101  2023-05-01         1  120000
1       1002           2          102  2023-05-03         1  250000
2       1003           3          105  2023-05-05         2   90000
3       1004           1          109  2023-05-10         1   95000
4       1005           4          107  2023-05-15         1  180000
5       1006           5          101  2023-05-20         1  120000
6       1007           6          105  2023-05-22         3  135000
7       1008           2          109  2023-05-25         1   95000
8       1009           7          110  2023-06-01         1  160000
9       1010           8          111  2023-06-05         2   70000
10      1011           9          104  2023-06-10         1  650000
11      1012          10          108  2023-06-15         1  220000
12      1013          11          103  2023-06-18         1   80000
13      1014          12          112  2023-06-20         1  300000
14      1015          13          102  2023-07-01         1  250000
15      1016          14          106  2023-07-05         2  240000
16      1017          15          107  2023-07-10         1  180000
17      1018           3          110  2023-07-15         1  160000
18      1019           6          111  2023-07-18         3  105000
19      1020           2          104  2023-07-20         1  650000

In [30]:
query = """
SELECT c.nombre, p.nombre_producto, v.fecha_venta, v.total
FROM ventas v
JOIN clientes c ON v.cliente_id = c.cliente_id
JOIN productos p ON v.producto_id = p.producto_id
"""

pd.read_sql(query, conn)

              nombre        nombre_producto fecha_venta   total
0          Ana Gómez  Auriculares Bluetooth  2023-05-01  120000
1       Carlos Pérez       Teclado Mecánico  2023-05-03  250000
2       Laura Torres        Camiseta Básica  2023-05-05   90000
3          Ana Gómez         Mochila Urbana  2023-05-10   95000
4        Miguel Ruiz     Zapatos Deportivos  2023-05-15  180000
5     Sofía Martínez  Auriculares Bluetooth  2023-05-20  120000
6       Andrés López        Camiseta Básica  2023-05-22  135000
7       Carlos Pérez         Mochila Urbana  2023-05-25   95000
8       David Zapata          Reloj Digital  2023-06-01  160000
9       Luis Ramirez                  Gorra  2023-06-05   70000
10      Camilo Celis            Monitor 24"  2023-06-10  650000
11        Lina Vélez               Chaqueta  2023-06-15  220000
12       Liss Franco      Mouse Inalámbrico  2023-06-18   80000
13        Kate Marin        Audífonos Gamer  2023-06-20  300000
14     Angel Sanchez       Teclado Mecánico  2023-07-01  250000
15  Fabián Rodriguez                  Jeans  2023-07-05  240000
16     Javier Torres     Zapatos Deportivos  2023-07-10  180000
17      Laura Torres          Reloj Digital  2023-07-15  160000
18      Andrés López                  Gorra  2023-07-18  105000
19      Carlos Pérez            Monitor 24"  2023-07-20  650000

### Clientes totales

In [31]:
query = """
SELECT COUNT(*) AS total_clientes
FROM clientes;
"""

pd.read_sql(query, conn)

   total_clientes
0              15

### Clientes por ciudad

In [32]:
query = """
SELECT ciudad, COUNT(*) AS cantidad_clientes
FROM clientes
GROUP BY ciudad
ORDER BY cantidad_clientes DESC;
"""

pd.read_sql(query, conn)

         ciudad  cantidad_clientes
0      Medellín                  4
1        Bogotá                  3
2     Cartagena                  2
3          Cali                  2
4  Barranquilla                  2
5   Santa Marta                  1
6         Bello                  1

### Ingresos totales

In [33]:
query = """
SELECT SUM(total) AS ingresos_totales
FROM ventas;
"""

pd.read_sql(query, conn)

   ingresos_totales
0           4150000

### Ingresos por ciudad

In [34]:
query = """
SELECT c.ciudad, SUM(v.total) AS ingresos
FROM ventas v
JOIN clientes c ON v.cliente_id = c.cliente_id
GROUP BY c.ciudad
ORDER BY ingresos DESC;
"""

pd.read_sql(query, conn)

         ciudad  ingresos
0      Medellín   1485000
1     Cartagena    950000
2        Bogotá    575000
3          Cali    490000
4         Bello    240000
5   Santa Marta    220000
6  Barranquilla    190000

### Productos más vendidos (por cantidad)

In [35]:
query = """
SELECT p.nombre_producto, SUM(v.cantidad) AS total_vendido
FROM ventas v
JOIN productos p ON v.producto_id = p.producto_id
GROUP BY p.nombre_producto
ORDER BY total_vendido DESC;
"""

pd.read_sql(query, conn)

          nombre_producto  total_vendido
0                   Gorra              5
1         Camiseta Básica              5
2      Zapatos Deportivos              2
3        Teclado Mecánico              2
4           Reloj Digital              2
5             Monitor 24"              2
6          Mochila Urbana              2
7                   Jeans              2
8   Auriculares Bluetooth              2
9       Mouse Inalámbrico              1
10               Chaqueta              1
11        Audífonos Gamer              1

### Productos que generan más ingresos

In [36]:
query = """
SELECT p.nombre_producto, SUM(v.total) AS ingresos
FROM ventas v
JOIN productos p ON v.producto_id = p.producto_id
GROUP BY p.nombre_producto
ORDER BY ingresos DESC;
"""

pd.read_sql(query, conn)

          nombre_producto  ingresos
0             Monitor 24"   1300000
1        Teclado Mecánico    500000
2      Zapatos Deportivos    360000
3           Reloj Digital    320000
4         Audífonos Gamer    300000
5                   Jeans    240000
6   Auriculares Bluetooth    240000
7         Camiseta Básica    225000
8                Chaqueta    220000
9          Mochila Urbana    190000
10                  Gorra    175000
11      Mouse Inalámbrico     80000

### Ticket promedio por venta

In [37]:
query = """
SELECT ROUND(AVG(total), 0) AS ticket_promedio
FROM ventas;
"""

pd.read_sql(query, conn)

   ticket_promedio
0         207500.0

### Clientes con mayor gasto

In [38]:
query = """
SELECT c.nombre, SUM(v.total) AS gasto_total
FROM ventas v
JOIN clientes c ON v.cliente_id = c.cliente_id
GROUP BY c.nombre
ORDER BY gasto_total DESC;
"""

pd.read_sql(query, conn)

              nombre  gasto_total
0       Carlos Pérez       995000
1       Camilo Celis       650000
2         Kate Marin       300000
3       Laura Torres       250000
4      Angel Sanchez       250000
5   Fabián Rodriguez       240000
6       Andrés López       240000
7         Lina Vélez       220000
8          Ana Gómez       215000
9        Miguel Ruiz       180000
10     Javier Torres       180000
11      David Zapata       160000
12    Sofía Martínez       120000
13       Liss Franco        80000
14      Luis Ramirez        70000

### Ventas por mes

In [39]:
query = """
SELECT 
    strftime('%Y-%m', fecha_venta) AS mes,
    SUM(total) AS ingresos
FROM ventas
GROUP BY mes
ORDER BY mes;
"""

pd.read_sql(query, conn)

       mes  ingresos
0  2023-05   1085000
1  2023-06   1480000
2  2023-07   1585000

### Resumen ejecutivo

In [40]:
query = """
SELECT
    COUNT(DISTINCT cliente_id) AS clientes_unicos,
    COUNT(*) AS total_ventas,
    SUM(total) AS ingresos_totales,
    ROUND(AVG(total), 0) AS ticket_promedio
FROM ventas;
"""

pd.read_sql(query, conn)

   clientes_unicos  total_ventas  ingresos_totales  ticket_promedio
0               15            20           4150000         207500.0

### Exportación de datos para visualización
Los datos se exportan a archivos CSV para su posterior análisis en Power BI.

In [41]:
pd.read_sql("SELECT * FROM clientes", conn).to_csv("clientes.csv", index=False)
pd.read_sql("SELECT * FROM productos", conn).to_csv("productos.csv", index=False)
pd.read_sql("SELECT * FROM ventas", conn).to_csv("ventas.csv", index=False)

In [42]:
conn.close()